tap 'homebrew/cbundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
brew 'ack'
brew 'antigen'
brew 'boost'
brew 'cmake'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'ffmpeg'
brew 'git'
brew 'graphviz'
brew 'htop'
brew 'imagemagick'
brew 'llvm'
brew 'macvim'
brew 'numpy'
brew 'pandoc-citeproc'
brew 'pandoc-crossref'
brew 'gpg'
brew 'pass'
brew 'php'
brew 'pipenv'
brew 'pkg-config'
brew 'poppler'
brew 'thefuck'
brew 'tldr'
brew 'unrar'
brew 'wget'
brew 'with-readline'
brew 'zsh'
cask 'amethyst'
cask 'blender'
cask 'discord'
cask 'docker'
cask 'etcher'
cask 'filezilla'
cask 'firefox'
cask 'font-fira-code'
cask 'godot'
cask 'google-chrome'
cask 'jabref'
cask 'java'
cask 'keepingyouawake'
cask 'libreoffice'
cask 'mactex'
cask 'mono-mdk'
cask 'protege'
cask 'skype'
cask 'slack'
cask 'splitshow'
cask 'telegram-desktop'
cask 'torbrowser'
cask 'unity-hub'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'xquartz'
mas 'Xcode', id: 497799835
