# REPOSITORIES
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/science'

# SHELL
brew 'zsh'
brew 'ack'
brew 'tldr'
brew 'antigen'
brew 'thefuck'
brew 'ccat'
brew 'htop'
cask 'caskroom/fonts/font-fira-code'

# PROGRAMMING & UTILITY
# mas 'Xcode', id: 497799835 # Will be done manually
brew 'bazel'
brew 'boost', args: ['c++11', 'with-icu4c']
brew 'cmake'
brew 'composer'
brew 'ctags'
brew 'doxygen', args: ['with-graphviz', 'with-llvm', 'with-qt']
brew 'glade'
brew 'git'
brew 'gtksourceview3'
brew 'macvim', args: ['with-override-system-vim', 'with-python3']
brew 'opencv3', args: ['HEAD', 'with-contrib', 'with-python3', 'with-ffmpeg']
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pandoc-crossref'
brew 'homebrew/php/php71'
brew 'homebrew/php/php71-xdebug'
brew 'homebrew/php/phpunit'
brew 'python3'
brew 'ruby'
brew 'valgrind', args: ['HEAD']
cask 'java'
cask 'mactex'
cask 'miniconda'
cask 'rstudio'

# PROGRAMMING LIBRARIES
brew 'boost', args: ['with-icu4c', 'c++11']
brew 'dlib', args: ['with-openblas', 'with-x11']
brew 'opencv'

# PRODUCTIVITY
cask 'filezilla'
cask 'gimp'
cask 'libreoffice'
cask 'splitshow'

# BROWSERS
cask 'brave'
cask 'caskroom/versions/firefox-beta'
cask 'google-chrome'
cask 'opera'
cask 'qutebrowser'
cask 'torbrowser'
cask 'vivaldi'


# OTHER
brew 'gpg'
cask 'amethyst'
cask 'android-file-transfer'
cask 'caffeine'
cask 'discord'
cask 'keybase'
cask 'skype'
cask 'steam'
cask 'telegram-desktop'

# Dependencies (just dumped)
brew 'cairo'
brew 'cask'
brew 'cscope'
brew 'dirmngr'
brew 'eigen'
brew 'emacs'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'gpg-agent'
brew 'r'
brew 'icu4c'
brew 'ilmbase'
brew 'isl'
brew 'jpeg'
brew 'lame'
brew 'libassuan'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'libtiff'
brew 'libusb'
brew 'libusb-compat'
brew 'mas'
brew 'mercurial'
brew 'mpfr'
brew 'numpy'
brew 'openexr'
brew 'openssl'
brew 'pcre'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'pth'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'x264'
brew 'xvid'
brew 'xz'
